In [33]:
import pandas as pd
import numpy as np
a = pd.Series([1,2,3,4])
b = pd.Series([5,6,7,8])
d = {"Apple":a, "Banana":b}
df = pd.DataFrame(d)
df

   Apple  Banana
0      1       5
1      2       6
2      3       7
3      4       8

In [26]:
data = {"City"      : ["Karachi", "Lahore", "Islamabad"],
        "Population": [18891354, 11126285, 1014825] }
frame = pd.DataFrame(data, index=[1,2,3], columns=["City","Population","Area"])
frame.Area = 100
frame.head(2)

      City  Population  Area
1  Karachi    18891354   100
2   Lahore    11126285   100

In [27]:
print(frame.columns)
print()
print(frame.index)

Index(['City', 'Population', 'Area'], dtype='object')

Int64Index([1, 2, 3], dtype='int64')

In [28]:
print(frame["City"])
print()
print(frame.City)

1      Karachi
2       Lahore
3    Islamabad
Name: City, dtype: object

1      Karachi
2       Lahore
3    Islamabad
Name: City, dtype: object

In [29]:
frame

        City  Population  Area
1    Karachi    18891354   100
2     Lahore    11126285   100
3  Islamabad     1014825   100

In [22]:
frame.loc[1]

City           Karachi
Population    18891354
Area               NaN
Name: 1, dtype: object

In [30]:
frame.loc[[1,3],["City","Area"]]

        City  Area
1    Karachi   100
3  Islamabad   100

In [31]:
frame.iloc[[0,2],[0,2]]

        City  Area
1    Karachi   100
3  Islamabad   100

# Arthmatic and Data Alignment:

In [39]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),
                  columns = list("ABC"),
                  index = ["Karachi","Lahore","Islamabad"])
df2 = pd.DataFrame(np.arange(12).reshape((4,3)),
                  columns = list("BCD"),
                  index = ["Karachi","Lahore","Islamabad","Quetta"])

In [45]:
print(df1)
print()
print(df2)
print()
df3 = df1 + df2
print(df3)

           A  B  C
Karachi    0  1  2
Lahore     3  4  5
Islamabad  6  7  8

           B   C   D
Karachi    0   1   2
Lahore     3   4   5
Islamabad  6   7   8
Quetta     9  10  11

            A     B     C   D
Islamabad NaN  13.0  15.0 NaN
Karachi   NaN   1.0   3.0 NaN
Lahore    NaN   7.0   9.0 NaN
Quetta    NaN   NaN   NaN NaN